In [1]:
%autosave 0

Autosave disabled

In [2]:
import pandas as pd
import pandasql

In [3]:
url ='https://docs.google.com/spreadsheets/d/1TIEmFXusr0-ZX2Ne0zqbu8EdmBPLdVi-e_vRYsnx5XQ/edit#gid=1755621245'

In [4]:
from oauth2client.service_account import ServiceAccountCredentials
import gspread

In [7]:
scope = ['https://www.googleapis.com/auth/spreadsheets']
credentials = ServiceAccountCredentials.from_json_keyfile_name('my_json_file.json', scope)
client = gspread.authorize(credentials)
sheet = client.open_by_url(url)
worksheet = sheet.get_worksheet(0)
results = worksheet.get_all_records()

In [8]:
result_df = pd.DataFrame(results)

In [9]:
result_df.head()

,ประทับเวลา,ระดับชั้นปีที่กำลังศึกษา,ความเร็วอินเตอร์เน็ตเพียงพอต่อการเรียนออนไลน์มากแค่ไหน,ความพร้อมในการเรียนออนไลน์,ไอแพดจำเป็นต่อการเรียนออนไลน์หรือไม่,คอมพิวเตอร์จำเป็นต่อการเรียนออนไลน์หรือไม่,โทรศัพท์จำเป็นต่อการเรียนออนไลน์หรือไม่
0,"12/8/2021, 20:39:56",ชั้นปีที่2,5,3,5,5,4
1,"12/8/2021, 20:40:26",ชั้นปีที่1,2,4,3,4,3
2,"12/8/2021, 20:40:41",ชั้นปีที่2,5,4,5,5,2
3,"12/8/2021, 20:40:55",ชั้นปีที่3,4,4,4,5,4
4,"12/8/2021, 20:41:10",ชั้นปีที่4,5,3,4,5,3

In [10]:
result_df.columns

Index(['ประทับเวลา', 'ระดับชั้นปีที่กำลังศึกษา',
       'ความเร็วอินเตอร์เน็ตเพียงพอต่อการเรียนออนไลน์มากแค่ไหน',
       'ความพร้อมในการเรียนออนไลน์', 'ไอแพดจำเป็นต่อการเรียนออนไลน์หรือไม่',
       'คอมพิวเตอร์จำเป็นต่อการเรียนออนไลน์หรือไม่',
       'โทรศัพท์จำเป็นต่อการเรียนออนไลน์หรือไม่'],
      dtype='object')

In [11]:
len(result_df.columns)

7

In [12]:
result_df.shape

(187, 7)

In [13]:
qdf =  pandasql.sqldf("select ระดับชั้นปีที่กำลังศึกษา from result_df group by ระดับชั้นปีที่กำลังศึกษา")

qdf.head(20)

  ระดับชั้นปีที่กำลังศึกษา
0           ชั้นประถมศึกษา
1               ชั้นปีที่1
2               ชั้นปีที่2
3               ชั้นปีที่3
4               ชั้นปีที่4
5           ชั้นมัธยมศึกษา

In [14]:
qdf =  pandasql.sqldf("select ระดับชั้นปีที่กำลังศึกษา, sum(ความเร็วอินเตอร์เน็ตเพียงพอต่อการเรียนออนไลน์มากแค่ไหน)/count(*) as q1 from result_df group by ระดับชั้นปีที่กำลังศึกษา")

qdf.head(20)

  ระดับชั้นปีที่กำลังศึกษา  q1
0           ชั้นประถมศึกษา   3
1               ชั้นปีที่1   3
2               ชั้นปีที่2   3
3               ชั้นปีที่3   4
4               ชั้นปีที่4   3
5           ชั้นมัธยมศึกษา   3

In [15]:
qdf =  pandasql.sqldf("select ระดับชั้นปีที่กำลังศึกษา, sum(ความพร้อมในการเรียนออนไลน์)/count(*) as q2 from result_df group by ระดับชั้นปีที่กำลังศึกษา")

qdf.head(20)

  ระดับชั้นปีที่กำลังศึกษา  q2
0           ชั้นประถมศึกษา   2
1               ชั้นปีที่1   3
2               ชั้นปีที่2   3
3               ชั้นปีที่3   3
4               ชั้นปีที่4   3
5           ชั้นมัธยมศึกษา   3

In [16]:
qdf =  pandasql.sqldf("select ระดับชั้นปีที่กำลังศึกษา, sum(ไอแพดจำเป็นต่อการเรียนออนไลน์หรือไม่)/count(*) as q3 from result_df group by ระดับชั้นปีที่กำลังศึกษา")

qdf.head(20)

  ระดับชั้นปีที่กำลังศึกษา  q3
0           ชั้นประถมศึกษา   3
1               ชั้นปีที่1   4
2               ชั้นปีที่2   4
3               ชั้นปีที่3   4
4               ชั้นปีที่4   4
5           ชั้นมัธยมศึกษา   4

In [17]:
qdf =  pandasql.sqldf("select ระดับชั้นปีที่กำลังศึกษา, sum(คอมพิวเตอร์จำเป็นต่อการเรียนออนไลน์หรือไม่)/count(*) as q4 from result_df group by ระดับชั้นปีที่กำลังศึกษา")

qdf.head(20)

  ระดับชั้นปีที่กำลังศึกษา  q4
0           ชั้นประถมศึกษา   3
1               ชั้นปีที่1   4
2               ชั้นปีที่2   4
3               ชั้นปีที่3   4
4               ชั้นปีที่4   4
5           ชั้นมัธยมศึกษา   4

In [18]:
qdf =  pandasql.sqldf("select ระดับชั้นปีที่กำลังศึกษา, sum(โทรศัพท์จำเป็นต่อการเรียนออนไลน์หรือไม่)/count(*) as q5 from result_df group by ระดับชั้นปีที่กำลังศึกษา")

qdf.head(20)

  ระดับชั้นปีที่กำลังศึกษา  q5
0           ชั้นประถมศึกษา   4
1               ชั้นปีที่1   3
2               ชั้นปีที่2   3
3               ชั้นปีที่3   3
4               ชั้นปีที่4   2
5           ชั้นมัธยมศึกษา   3

In [19]:
q1 = 'sum(ความเร็วอินเตอร์เน็ตเพียงพอต่อการเรียนออนไลน์มากแค่ไหน)/count(*) as q1'
q2 = 'sum(ความพร้อมในการเรียนออนไลน์)/count(*) as q2'
q3 = 'sum(ไอแพดจำเป็นต่อการเรียนออนไลน์หรือไม่)/count(*) as q3'
q4 = 'sum(คอมพิวเตอร์จำเป็นต่อการเรียนออนไลน์หรือไม่)/count(*) as q4'
q5 = 'sum(โทรศัพท์จำเป็นต่อการเรียนออนไลน์หรือไม่)/count(*) as q5'

In [20]:
sql = "select ระดับชั้นปีที่กำลังศึกษา, %s, %s, %s, %s, %s from result_df group by ระดับชั้นปีที่กำลังศึกษา" % (q1, q2, q3, q4, q5)

In [21]:
sql

'select ระดับชั้นปีที่กำลังศึกษา, sum(ความเร็วอินเตอร์เน็ตเพียงพอต่อการเรียนออนไลน์มากแค่ไหน)/count(*) as q1, sum(ความพร้อมในการเรียนออนไลน์)/count(*) as q2, sum(ไอแพดจำเป็นต่อการเรียนออนไลน์หรือไม่)/count(*) as q3, sum(คอมพิวเตอร์จำเป็นต่อการเรียนออนไลน์หรือไม่)/count(*) as q4, sum(โทรศัพท์จำเป็นต่อการเรียนออนไลน์หรือไม่)/count(*) as q5 from result_df group by ระดับชั้นปีที่กำลังศึกษา'

In [22]:
sum_report =  pandasql.sqldf(sql)

sum_report.head(20)

  ระดับชั้นปีที่กำลังศึกษา  q1  q2  q3  q4  q5
0           ชั้นประถมศึกษา   3   2   3   3   4
1               ชั้นปีที่1   3   3   4   4   3
2               ชั้นปีที่2   3   3   4   4   3
3               ชั้นปีที่3   4   3   4   4   3
4               ชั้นปีที่4   3   3   4   4   2
5           ชั้นมัธยมศึกษา   3   3   4   4   3

In [23]:
sum_report['sum'] = sum_report.sum(axis=1)

<ipython-input-23-6e4a4c5b7531>:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  sum_report['sum'] = sum_report.sum(axis=1)

In [24]:
sum_report.head(20)

  ระดับชั้นปีที่กำลังศึกษา  q1  q2  q3  q4  q5  sum
0           ชั้นประถมศึกษา   3   2   3   3   4   15
1               ชั้นปีที่1   3   3   4   4   3   17
2               ชั้นปีที่2   3   3   4   4   3   17
3               ชั้นปีที่3   4   3   4   4   3   18
4               ชั้นปีที่4   3   3   4   4   2   16
5           ชั้นมัธยมศึกษา   3   3   4   4   3   17

In [25]:
qdf =  pandasql.sqldf("select * from sum_report order by sum desc")

qdf.head(20)

  ระดับชั้นปีที่กำลังศึกษา  q1  q2  q3  q4  q5  sum
0               ชั้นปีที่3   4   3   4   4   3   18
1               ชั้นปีที่1   3   3   4   4   3   17
2               ชั้นปีที่2   3   3   4   4   3   17
3           ชั้นมัธยมศึกษา   3   3   4   4   3   17
4               ชั้นปีที่4   3   3   4   4   2   16
5           ชั้นประถมศึกษา   3   2   3   3   4   15

In [26]:
qdf.to_csv('score.csv', encoding='utf8', index=False)